<template><div><h1 id="предисловие" tabindex="-1"><a class="header-anchor" href="#предисловие"><span>Предисловие</span></a></h1>
<div class="hint-container info">
<p class="hint-container-title">Дисклеймер</p>
<p>Основная часть глав учебника сгенерирована с помощью ИИ. Редактура и вычитка проводилась людьми.</p>
</div>
<p>Этот учебник я решил создать для структурирования своих знаний, в процессе изучения языка. Он не претендует на полноту, а лишь отражает ту информацию, которую я изучил.</p>
<p>Я постарался сделать этот учебник в том виде, в котором сам хотел бы изучать язык GO.</p>
<p>Каждая глава включает:</p>
<ul>
<li><strong>Теорию</strong>: подробное объяснение темы с примерами кода и комментариями</li>
<li><strong>Тесты</strong>: вопросы по теоретической части с выбором ответа</li>
<li><strong>Задание</strong>: короткие практические упражнения для закрепления полученных знаний</li>
</ul>
</div></template>


